MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_pwr.h
/**
  **********************************************************************************************************************
  * @file    stm32c5xx_ll_pwr.h
  * @brief   Header file for PWR LL module.
  **********************************************************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file in the root directory of this software
  * component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  **********************************************************************************************************************
  */

/* Define to prevent recursive inclusion -----------------------------------------------------------------------------*/
#ifndef STM32C5XX_LL_PWR_H
#define STM32C5XX_LL_PWR_H

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/* Includes ----------------------------------------------------------------------------------------------------------*/
#include "stm32c5xx.h"

/** @addtogroup STM32C5xx_LL_Driver
  * @{
  */

#if defined (PWR)

/** @defgroup PWR_LL PWR
  * @{
  */

/* Private constants -------------------------------------------------------------------------------------------------*/
/** @defgroup PWR_LL_Private_Constants PWR Private Constants
  * @{
  */

/** @defgroup PWR_LL_WAKEUP_PIN_OFFSET Wake-Up Pins register offset defines
  * @brief    Flag definitions that can be used with LL_PWR_WriteReg function.
  * @{
  */
/* Wake-Up Pins PWR register offsets */
#define LL_PWR_WAKEUP_PINS_PULL_SHIFT_OFFSET    2UL
#define LL_PWR_WAKEUP_PINS_MAX_SHIFT_MASK       0x7FU
#define LL_PWR_WAKEUP_PIN_REF                   PWR_WUCR_WUPP1
#define LL_PWR_WAKEUP_PIN_REF_POS               PWR_WUCR_WUPP1_Pos
#define LL_PWR_WAKEUP_PIN_PULL_REF              PWR_WUCR_WUPPUPD1
#define LL_PWR_WAKEUP_PIN_PULL_REF_POS          PWR_WUCR_WUPPUPD1_Pos
/**
  * @}
  */

/** @defgroup PWR_LL_SRAM2_STOP_RETENTION_POSITION SRAM2 stop retention bit positions
  * @brief    Position definitions that can be used in HAL_PWR_LP_EnableMemoryPageRetention /
  *           HAL_PWR_LP_EnableMemoryPageRetention functions.
  * @{
  */
#if defined(PWR_PMCR_SRAM2_1_SO_Pos)
#define LL_PWR_SRAM2_STOP_RETENTION_POS     PWR_PMCR_SRAM2_1_SO_Pos /*!< SRAM2 Page 1 retention in stop mode position */
#else
#define LL_PWR_SRAM2_STOP_RETENTION_POS     PWR_PMCR_SRAM2SO_Pos    /*!< SRAM2 retention in stop mode position */

#endif /* PWR_PMCR_SRAM2_1_SO_Pos */
/**
  * @}
  */

/**
  * @}
  */
/* Exported constants ------------------------------------------------------------------------------------------------*/

/** @defgroup PWR_LL_Exported_Constants LL PWR Constants
  * @{
  */

/** @defgroup PWR_LL_EC_LOW_POWER_MODE_SELECTION  Low Power Mode Selection
  * @{
  */
#define LL_PWR_STOP0_MODE     0U                  /*!< STOP0 mode    */
#define LL_PWR_STOP1_MODE     PWR_PMCR_LPMS_0     /*!< STOP1 mode    */
#define LL_PWR_STANDBY_MODE   PWR_PMCR_LPMS_1     /*!< STANDBY mode  */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_SRAM1_STOP_CONTENTS_RETENTION PWR SRAM1 Content retention in stop mode
  * @{
  */
#define LL_PWR_SRAM1_STOP_RETENTION    PWR_PMCR_SRAM1SO  /*!< SRAM1 retention in stop mode  */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_SRAM2_STOP_CONTENTS_RETENTION PWR SRAM2 Content retention in stop mode
  * @{
  */
#if defined(PWR_PMCR_SRAM2_1_SO)
#define LL_PWR_SRAM2_PAGE1_STOP_RETENTION   PWR_PMCR_SRAM2_1_SO     /*!< SRAM2 Page 1 retention in stop mode          */
#define LL_PWR_SRAM2_PAGE2_STOP_RETENTION   PWR_PMCR_SRAM2_2_SO     /*!< SRAM2 Page 2 retention in stop mode          */
#if defined(PWR_PMCR_SRAM2_3_SO)
#define LL_PWR_SRAM2_PAGE3_STOP_RETENTION   PWR_PMCR_SRAM2_3_SO     /*!< SRAM2 Page 3 retention in stop mode          */
#define LL_PWR_SRAM2_STOP_RETENTION         (PWR_PMCR_SRAM2_3_SO | PWR_PMCR_SRAM2_2_SO | PWR_PMCR_SRAM2_1_SO)
/*!< SRAM2 retention in stop mode */
#else
#define LL_PWR_SRAM2_STOP_RETENTION         (PWR_PMCR_SRAM2_2_SO | PWR_PMCR_SRAM2_1_SO)  /*!< SRAM2 retention
                                                                                              in stop mode            */
#endif /* PWR_PMCR_SRAM2_3_SO */
#else
#define LL_PWR_SRAM2_STOP_RETENTION         PWR_PMCR_SRAM2SO /*!< SRAM2 retention in stop mode */
#endif /* PWR_PMCR_SRAM2_1_SO */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_WAKEUP_PIN PWR Wake Up Pin
  * @{
  */
#define LL_PWR_WAKEUP_PIN_1   PWR_WUCR_WUPEN1  /*!< Wakeup pin 1 enable */
#define LL_PWR_WAKEUP_PIN_2   PWR_WUCR_WUPEN2  /*!< Wakeup pin 2 enable */
#if defined(PWR_WUCR_WUPEN3)
#define LL_PWR_WAKEUP_PIN_3   PWR_WUCR_WUPEN3  /*!< Wakeup pin 3 enable */
#endif /* PWR_WUCR_WUPEN3 */
#define LL_PWR_WAKEUP_PIN_4   PWR_WUCR_WUPEN4  /*!< Wakeup pin 4 enable */
#define LL_PWR_WAKEUP_PIN_5   PWR_WUCR_WUPEN5  /*!< Wakeup pin 5 enable */
#if defined(PWR_WUCR_WUPEN6)
#define LL_PWR_WAKEUP_PIN_6   PWR_WUCR_WUPEN6  /*!< Wakeup pin 6 enable */
#endif /* PWR_WUCR_WUPEN6 */
#if defined(PWR_WUCR_WUPEN7)
#define LL_PWR_WAKEUP_PIN_7   PWR_WUCR_WUPEN7  /*!< Wakeup pin 7 enable */
#endif /* PWR_WUCR_WUPEN7 */
#if defined(PWR_WUCR_WUPEN3) && defined(PWR_WUCR_WUPEN6) && defined(PWR_WUCR_WUPEN7)
#define LL_PWR_WAKEUP_PIN_ALL (0x7FU)          /*!< Wakeup all pin enable */
#else
#define LL_PWR_WAKEUP_PIN_ALL (0x1BU)          /*!< Wakeup all pin enable */
#endif /* PWR_WUCR_WUPEN3 && PWR_WUCR_WUPEN6 && PWR_WUCR_WUPEN7 */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_WAKEUP_PIN_PULL  Wakeup Pins pull configuration
  * @{
  */
#define LL_PWR_WAKEUP_PIN_PULL_NO     0x00000000UL   /*!< Configure Wake-Up pin in no pull   */
#define LL_PWR_WAKEUP_PIN_PULL_UP     0x00000001UL   /*!< Configure Wake-Up pin in pull Up   */
#define LL_PWR_WAKEUP_PIN_PULL_DOWN   0x00000002UL   /*!< Configure Wake-Up pin in pull Down */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_WAKEUP_PIN_POLARITY  Wakeup Pins polarity
  * @{
  */
#define LL_PWR_WAKEUP_PIN_POLARITY_HIGH     0x00000000UL   /*!< Wakeup pin polarity high  */
#define LL_PWR_WAKEUP_PIN_POLARITY_LOW      0x00000001UL   /*!< Wakeup pin polarity low   */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_IO_RETENTION  Privilege items
  * @{
  */
#define LL_PWR_IO_RETENTION_GPIO    PWR_IORETR_IORETEN      /*!< GPIO retention in Standby Mode   */
#define LL_PWR_IO_RETENTION_JTAGIO  PWR_IORETR_JTAGIORETEN  /*!< JTAGIO retention in Standby Mode */
#define LL_PWR_IO_RETENTION_ALL     (PWR_IORETR_IORETEN | PWR_IORETR_JTAGIORETEN) /*!< All IO retention in Standby
                                                                                       Mode  */
/**
  * @}
  */

/** @defgroup PWR_LL_EC_PRIVILEGE_ITEM  Privilege items
  * @{
  */
#define LL_PWR_PRIV_ITEM_ALL     PWR_PRIVCFGR_PRIV   /*!< All privilege items  */
/**
  * @}
  */

