MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_pwr.h
/** @defgroup PWR_LL_EC_PRIVILEGE_ATTRIBUTE  Privilege attribute
  * @{
  */
#define LL_PWR_ATTR_NPRIV     0U   /*!< Non-privileged attribute  */
#define LL_PWR_ATTR_PRIV      1U   /*!< Privileged attribute      */
/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ----------------------------------------------------------------------------------------------------*/

/** @defgroup PWR_LL_Exported_Macros LL PWR Macros
  * @{
  */

/** @defgroup PWR_LL_EM_WRITE_READ Common Write and Read Registers Macros
  * @{
  */

/**
  * @brief  Write a value in PWR register.
  * @param  reg      Register to be written.
  * @param  value    Value to be written in the register.
  *
  */
#define LL_PWR_WRITE_REG(reg, value) STM32_WRITE_REG(PWR->reg, (value))

/**
  * @brief  Read a value in PWR register.
  * @param  reg      Register to be read.
  * @retval Register value
  */
#define LL_PWR_READ_REG(reg) STM32_READ_REG(PWR->reg)
/**
  * @}
  */

/**
  * @}
  */

/* Exported functions ------------------------------------------------------------------------------------------------*/

/** @defgroup PWR_LL_Exported_Functions LL PWR Functions
  * @{
  */

/** @defgroup PWR_LL_EF_CONFIGURATION PWR Configuration
  * @{
  */

/**
  * @brief  Set system power mode.
  * @rmtoll
  *  PMCR              LPMS          LL_PWR_SetPowerMode
  * @param  mode : This parameter can be one of the following values:
  *         @arg @ref LL_PWR_STOP0_MODE
  *         @arg @ref LL_PWR_STOP1_MODE
  *         @arg @ref LL_PWR_STANDBY_MODE
  * @note   When Stop mode is selected, WFI or WFE instruction is required to enter Stop mode.
  * @note   When Standby mode is selected, only WFI instruction is required to enter Standby mode.
  * @note   Call DSB instruction to ensure there are no outstanding memory transactions prior to executing WFI or WFE.
  */
__STATIC_INLINE void LL_PWR_SetPowerMode(uint32_t mode)
{
  STM32_MODIFY_REG(PWR->PMCR, PWR_PMCR_LPMS, mode);
}

/**
  * @brief  Get system power mode.
  * @rmtoll
  *  PMCR             LPMS          LL_PWR_GetPowerMode
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_PWR_STOP0_MODE
  *         @arg @ref LL_PWR_STOP1_MODE
  *         @arg @ref LL_PWR_STANDBY_MODE
  */
__STATIC_INLINE uint32_t LL_PWR_GetPowerMode(void)
{
  return (STM32_READ_BIT(PWR->PMCR, PWR_PMCR_LPMS));
}

/**
  * @brief  Enable the flash power down in stop mode.
  * @rmtoll
  *  PMCR    FLPS       LL_PWR_EnableFlashLowPWRMode
  */
__STATIC_INLINE void LL_PWR_EnableFlashLowPWRMode(void)
{
  STM32_SET_BIT(PWR->PMCR, PWR_PMCR_FLPS);
}

/**
  * @brief  Disable the flash power down in stop mode.
  * @rmtoll
  *  PMCR    FLPS       LL_PWR_DisableFlashLowPWRMode
  */
__STATIC_INLINE void LL_PWR_DisableFlashLowPWRMode(void)
{
  STM32_CLEAR_BIT(PWR->PMCR, PWR_PMCR_FLPS);
}

/**
  * @brief  Check whether the flash power down in stop mode is enabled.
  * @rmtoll
  *  PMCR    FLPS       LL_PWR_IsEnabledFlashLowPWRMode
  * @return State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledFlashLowPWRMode(void)
{
  return ((STM32_READ_BIT(PWR->PMCR, PWR_PMCR_FLPS) == (PWR_PMCR_FLPS)) ? 1UL : 0UL);
}

/**
  * @brief  Enable memory content stop retention.
  * @rmtoll
  *  PMCR              SRAM1SO       LL_PWR_EnableMemoryStopRetention \n
#if PWR_PMCR_SRAM2_1_SO
  *  PMCR              SRAM2_1_SO    LL_PWR_EnableMemoryStopRetention \n
#if PWR_PMCR_SRAM2_3_SO
  *  PMCR              SRAM2_2_SO    LL_PWR_EnableMemoryStopRetention \n
  *  PMCR              SRAM2_3_SO    LL_PWR_EnableMemoryStopRetention
#else
  *  PMCR              SRAM2SO       LL_PWR_EnableMemoryStopRetention
#endif
#endif
  * @param  memory This parameter can be one of the following values:
  *         @arg @ref LL_PWR_SRAM1_STOP_RETENTION
  *         @arg @ref LL_PWR_SRAM2_STOP_RETENTION
  * @note   (*) value not defined in all devices
  */
__STATIC_INLINE void LL_PWR_EnableMemoryStopRetention(uint32_t memory)
{
  STM32_CLEAR_BIT(PWR->PMCR, memory);
}

/**
  * @brief  Disable memory content stop retention.
  * @rmtoll
  *  PMCR              SRAM1SO       LL_PWR_DisableMemoryStopRetention \n
#if PWR_PMCR_SRAM2_1_SO
  *  PMCR              SRAM2_1_SO    LL_PWR_DisableMemoryStopRetention \n
#if PWR_PMCR_SRAM2_3_SO
  *  PMCR              SRAM2_2_SO    LL_PWR_DisableMemoryStopRetention \n
  *  PMCR              SRAM2_3_SO    LL_PWR_DisableMemoryStopRetention
#else
  *  PMCR              SRAM2SO       LL_PWR_DisableMemoryStopRetention
#endif
#endif
  * @param  memory This parameter can be one of the following values:
  *         @arg @ref LL_PWR_SRAM1_STOP_RETENTION
  *         @arg @ref LL_PWR_SRAM2_STOP_RETENTION
  * @note   (*) value not defined in all devices
  */
__STATIC_INLINE void LL_PWR_DisableMemoryStopRetention(uint32_t memory)
{
  STM32_SET_BIT(PWR->PMCR, memory);
}

/**
  * @brief  Get memory content stop retention.
  * @rmtoll
  *  PMCR              SRAM1SO       LL_PWR_IsEnabledMemoryStopRetention \n
#if PWR_PMCR_SRAM2_1_SO
  *  PMCR              SRAM2_1_SO    LL_PWR_IsEnabledMemoryStopRetention \n
#if PWR_PMCR_SRAM2_3_SO
  *  PMCR              SRAM2_2_SO    LL_PWR_IsEnabledMemoryStopRetention \n
  *  PMCR              SRAM2_3_SO    LL_PWR_IsEnabledMemoryStopRetention
#else
  *  PMCR              SRAM2SO    LL_PWR_IsEnabledMemoryStopRetention
#endif
#endif
  * @param  memory This parameter can be one of the following values:
  *         @arg @ref LL_PWR_SRAM1_STOP_RETENTION
  *         @arg @ref LL_PWR_SRAM2_STOP_RETENTION
  * @retval 0 if disabled, 1 if enabled
  * @note   (*) value not defined in all devices
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledMemoryStopRetention(uint32_t memory)
{
  return ((STM32_READ_BIT(PWR->PMCR, memory) == (memory)) ? 0UL : 1UL);
}

#if defined(PWR_PMCR_SRAM2_1_SO)
/**
  * @brief  Enable SRAM2 page 1 content stop retention.
  * @rmtoll
  *  PMCR              SRAM2_1_SO   LL_PWR_EnableSRAM2Page1StopRetention
  */
__STATIC_INLINE void LL_PWR_EnableSRAM2Page1StopRetention(void)
{
  STM32_CLEAR_BIT(PWR->PMCR, LL_PWR_SRAM2_PAGE1_STOP_RETENTION);
}

/**
  * @brief  Enable SRAM2 page 2 content stop retention.
  * @rmtoll
  *  PMCR              SRAM2_2_SO   LL_PWR_EnableSRAM2Page2StopRetention
  */
__STATIC_INLINE void LL_PWR_EnableSRAM2Page2StopRetention(void)
{
  STM32_CLEAR_BIT(PWR->PMCR, LL_PWR_SRAM2_PAGE2_STOP_RETENTION);
}

#if defined(PWR_PMCR_SRAM2_3_SO)
/**
  * @brief  Enable SRAM2 page 3 content stop retention.
  * @rmtoll
  *  PMCR              SRAM2_3_SO   LL_PWR_EnableSRAM2Page3StopRetention
  */
__STATIC_INLINE void LL_PWR_EnableSRAM2Page3StopRetention(void)
{
  STM32_CLEAR_BIT(PWR->PMCR, LL_PWR_SRAM2_PAGE3_STOP_RETENTION);
}
#endif /* PWR_PMCR_SRAM2_3_SO */

/**
  * @brief  Enable SRAM2 page(s) content stop retention.
  * @rmtoll
  *  PMCR              SRAM2_1_SO   LL_PWR_EnableSRAM2PagesStopRetention \n
#if PWR_PMCR_SRAM2_3_SO
  *  PMCR              SRAM2_2_SO   LL_PWR_EnableSRAM2PagesStopRetention \n
  *  PMCR              SRAM2_3_SO   LL_PWR_EnableSRAM2PagesStopRetention
#else
  *  PMCR              SRAM2_2_SO   LL_PWR_EnableSRAM2PagesStopRetention
#endif
  * @param  pages This parameter is a bitfield representing each page of the SRAM2
  * @note   (*) value not defined in all devices
  */
__STATIC_INLINE void LL_PWR_EnableSRAM2PagesStopRetention(uint32_t pages)
{
  STM32_CLEAR_BIT(PWR->PMCR, (pages & LL_PWR_SRAM2_STOP_RETENTION));
}

/**
  * @brief  Disable SRAM2 page 1 content stop retention.
  * @rmtoll
  *  PMCR              SRAM2_1_SO   LL_PWR_DisableSRAM2Page1StopRetention
  */
__STATIC_INLINE void LL_PWR_DisableSRAM2Page1StopRetention(void)
{
  STM32_SET_BIT(PWR->PMCR, LL_PWR_SRAM2_PAGE1_STOP_RETENTION);
}

/**
  * @brief  Disable SRAM2 page 2 content stop retention.
  * @rmtoll
  *  PMCR              SRAM2_2_SO   LL_PWR_DisableSRAM2Page2StopRetention
  */
__STATIC_INLINE void LL_PWR_DisableSRAM2Page2StopRetention(void)
{
  STM32_SET_BIT(PWR->PMCR, LL_PWR_SRAM2_PAGE2_STOP_RETENTION);
}

#if defined(PWR_PMCR_SRAM2_3_SO)
/**
  * @brief  Disable SRAM2 page 3 content stop retention.
  * @rmtoll
  *  PMCR              SRAM2_3_SO   LL_PWR_DisableSRAM2Page3StopRetention
  */
__STATIC_INLINE void LL_PWR_DisableSRAM2Page3StopRetention(void)
{
  STM32_SET_BIT(PWR->PMCR, LL_PWR_SRAM2_PAGE3_STOP_RETENTION);
}
#endif /* PWR_PMCR_SRAM2_3_SO */

/**
  * @brief  Disable SRAM2 page(s) content stop retention.
  * @rmtoll
  *  PMCR              SRAM2_1_SO   LL_PWR_DisableSRAM2PagesStopRetention \n
#if PWR_PMCR_SRAM2_3_SO
  *  PMCR              SRAM2_2_SO   LL_PWR_DisableSRAM2PagesStopRetention \n
  *  PMCR              SRAM2_3_SO   LL_PWR_DisableSRAM2PagesStopRetention
#else
  *  PMCR              SRAM2_2_SO   LL_PWR_DisableSRAM2PagesStopRetention
#endif
  * @param  pages This parameter is a bitfield representing each page of the SRAM2
  * @note   (*) value not defined in all devices
  */
__STATIC_INLINE void LL_PWR_DisableSRAM2PagesStopRetention(uint32_t pages)
{
  STM32_SET_BIT(PWR->PMCR, (pages & LL_PWR_SRAM2_STOP_RETENTION));
}

/**
  * @brief  Check SRAM2 page 1 content stop retention.
  * @rmtoll
  *  PMCR              SRAM2_1_SO   LL_PWR_IsEnabledSRAM2Page1StopRetention
  * @retval 1 if the memory page is retained, 0 otherwise.
  * @note   (*) value not defined in all devices
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledSRAM2Page1StopRetention(void)
{
  return ((STM32_READ_BIT(PWR->PMCR, LL_PWR_SRAM2_PAGE1_STOP_RETENTION) == (LL_PWR_SRAM2_PAGE1_STOP_RETENTION))
          ? 0UL : 1UL);
}

/**
  * @brief  Check SRAM2 page 2 content stop retention.
  * @rmtoll
  *  PMCR              SRAM2_2_SO   LL_PWR_IsEnabledSRAM2Page2StopRetention
  * @retval 1 if the memory page is retained, 0 otherwise.
  * @note   (*) value not defined in all devices
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledSRAM2Page2StopRetention(void)
{
  return ((STM32_READ_BIT(PWR->PMCR, LL_PWR_SRAM2_PAGE2_STOP_RETENTION) == (LL_PWR_SRAM2_PAGE2_STOP_RETENTION))
          ? 0UL : 1UL);
}

#if defined(PWR_PMCR_SRAM2_3_SO)
/**
  * @brief  Check SRAM2 page 3 content stop retention.
  * @rmtoll
  *  PMCR              SRAM2_3_SO   LL_PWR_IsEnabledSRAM2Page3StopRetention
  * @retval 1 if the memory page is retained, 0 otherwise.
  * @note   (*) value not defined in all devices
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledSRAM2Page3StopRetention(void)
{
  return ((STM32_READ_BIT(PWR->PMCR, LL_PWR_SRAM2_PAGE3_STOP_RETENTION) == (LL_PWR_SRAM2_PAGE3_STOP_RETENTION))
          ? 0UL : 1UL);
}
#endif /* PWR_PMCR_SRAM2_3_SO */

/**
  * @brief  Check SRAM2 page content stop retention.
  * @rmtoll
  *  PMCR              SRAM2_1_SO   LL_PWR_IsEnabledSRAM2PagesStopRetention \n
#if PWR_PMCR_SRAM2_3_SO
  *  PMCR              SRAM2_2_SO   LL_PWR_IsEnabledSRAM2PagesStopRetention \n
  *  PMCR              SRAM2_3_SO   LL_PWR_IsEnabledSRAM2PagesStopRetention
#else
  *  PMCR              SRAM2_2_SO   LL_PWR_IsEnabledSRAM2PagesStopRetention
#endif
  * @param  page This parameter is a bitfield representing each page of the SRAM2
  * @retval 1 if the memory page is retained, 0 otherwise.
  * @note   (*) value not defined in all devices
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledSRAM2PagesStopRetention(uint32_t page)
{
  return ((STM32_READ_BIT(PWR->PMCR, page) == (page)) ? 0UL : 1UL);
}
#endif /* PWR_PMCR_SRAM2_1_SO */

/**
  * @brief  Enable RTC domain write protection.
  * @rmtoll
  *  RTCCR    DRTCP       LL_PWR_EnableRTCDomainWriteProtection
  */
__STATIC_INLINE void LL_PWR_EnableRTCDomainWriteProtection(void)
{
  STM32_CLEAR_BIT(PWR->RTCCR, PWR_RTCCR_DRTCP);
}

/**
  * @brief  Disable RTC domain write protection.
  * @rmtoll
  *  RTCCR    DRTCP       LL_PWR_DisableRTCDomainWriteProtection
  */
__STATIC_INLINE void LL_PWR_DisableRTCDomainWriteProtection(void)
{
  STM32_SET_BIT(PWR->RTCCR, PWR_RTCCR_DRTCP);
}

/**
  * @brief  Check whether the RTC domain write protection is enabled.
  * @rmtoll
  *  RTCCR    DRTCP       LL_PWR_IsEnabledRTCDomainWriteProtection
  * @return State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledRTCDomainWriteProtection(void)
{
  return ((STM32_READ_BIT(PWR->RTCCR, PWR_RTCCR_DRTCP) == (PWR_RTCCR_DRTCP)) ? 0UL : 1UL);
}

/**
  * @brief  Enable Power Voltage Detector.
  * @rmtoll
  *  VMCR    PVDEN       LL_PWR_EnablePVD
  */
__STATIC_INLINE void LL_PWR_EnablePVD(void)
{
  STM32_SET_BIT(PWR->VMCR, PWR_VMCR_PVDE);
}

/**
  * @brief  Disable Power Voltage Detector.
  * @rmtoll
  *  VMCR    PVDEN       LL_PWR_DisablePVD
  */
__STATIC_INLINE void LL_PWR_DisablePVD(void)
{
  STM32_CLEAR_BIT(PWR->VMCR, PWR_VMCR_PVDE);
}

/**
  * @brief  Check whether Power Voltage Detector is enabled.
  * @rmtoll
  *  VMCR    PVDEN       LL_PWR_IsEnabledPVD
  * @return State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledPVD(void)
{
  return ((STM32_READ_BIT(PWR->VMCR, PWR_VMCR_PVDE) == (PWR_VMCR_PVDE)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the wake up pin 1.
  * @rmtoll
  *  WUCR    WUPEN1       LL_PWR_EnableWakeUpPin1
  */
__STATIC_INLINE void LL_PWR_EnableWakeUpPin1(void)
{
  STM32_SET_BIT(PWR->WUCR, LL_PWR_WAKEUP_PIN_1);
}

/**
  * @brief  Enable the wake up pin 2.
  * @rmtoll
  *  WUCR    WUPEN2       LL_PWR_EnableWakeUpPin2
  */
__STATIC_INLINE void LL_PWR_EnableWakeUpPin2(void)
{
  STM32_SET_BIT(PWR->WUCR, LL_PWR_WAKEUP_PIN_2);
}

#if defined(PWR_WUCR_WUPEN3)
/**
  * @brief  Enable the wake up pin 3.
  * @rmtoll
  *  WUCR    WUPEN3       LL_PWR_EnableWakeUpPin3
  */
__STATIC_INLINE void LL_PWR_EnableWakeUpPin3(void)
{
  STM32_SET_BIT(PWR->WUCR, LL_PWR_WAKEUP_PIN_3);
}
#endif /* PWR_WUCR_WUPEN3 */

/**
  * @brief  Enable the wake up pin 4.
  * @rmtoll
  *  WUCR    WUPEN4       LL_PWR_EnableWakeUpPin4
  */
__STATIC_INLINE void LL_PWR_EnableWakeUpPin4(void)
{
  STM32_SET_BIT(PWR->WUCR, LL_PWR_WAKEUP_PIN_4);
}

/**
  * @brief  Enable the wake up pin 5.
  * @rmtoll
  *  WUCR    WUPEN5       LL_PWR_EnableWakeUpPin5
  */
__STATIC_INLINE void LL_PWR_EnableWakeUpPin5(void)
{
  STM32_SET_BIT(PWR->WUCR, LL_PWR_WAKEUP_PIN_5);
}

#if defined(PWR_WUCR_WUPEN6)
/**
  * @brief  Enable the wake up pin 6.
  * @rmtoll
  *  WUCR    WUPEN6       LL_PWR_EnableWakeUpPin6
  */
__STATIC_INLINE void LL_PWR_EnableWakeUpPin6(void)
{
  STM32_SET_BIT(PWR->WUCR, LL_PWR_WAKEUP_PIN_6);
}
#endif /* PWR_WUCR_WUPEN6 */

#if defined(PWR_WUCR_WUPEN7)
/**
  * @brief  Enable the wake up pin 7.
  * @rmtoll
  *  WUCR    WUPEN7       LL_PWR_EnableWakeUpPin7
  */
__STATIC_INLINE void LL_PWR_EnableWakeUpPin7(void)
{
  STM32_SET_BIT(PWR->WUCR, LL_PWR_WAKEUP_PIN_7);
}
#endif /* PWR_WUCR_WUPEN7 */

/**
  * @brief  Enable the wake up pin_x.
  * @rmtoll
  *  WUCR    WUPENx       LL_PWR_EnableWakeUpPin
  * @param  wakeup_pin This parameter can be a combination of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN_1
  *         @arg @ref LL_PWR_WAKEUP_PIN_2
#if PWR_WUCR_WUPEN3
  *         @arg @ref LL_PWR_WAKEUP_PIN_3
#endif
  *         @arg @ref LL_PWR_WAKEUP_PIN_4
  *         @arg @ref LL_PWR_WAKEUP_PIN_5
#if PWR_WUCR_WUPEN6
  *         @arg @ref LL_PWR_WAKEUP_PIN_6
#endif
#if PWR_WUCR_WUPEN7
  *         @arg @ref LL_PWR_WAKEUP_PIN_7
#endif
  *         @arg @ref LL_PWR_WAKEUP_PIN_ALL
  */
__STATIC_INLINE void LL_PWR_EnableWakeUpPin(uint32_t wakeup_pin)
{
  STM32_SET_BIT(PWR->WUCR, wakeup_pin);
}

/**
  * @brief  Disable the wake up pin 1.
  * @rmtoll
  *  WUCR    WUPEN1       LL_PWR_DisableWakeUpPin1
  */
__STATIC_INLINE void LL_PWR_DisableWakeUpPin1(void)
{
  STM32_CLEAR_BIT(PWR->WUCR, LL_PWR_WAKEUP_PIN_1);
}

/**
  * @brief  Disable the wake up pin 2.
  * @rmtoll
  *  WUCR    WUPEN2       LL_PWR_DisableWakeUpPin2
  */
__STATIC_INLINE void LL_PWR_DisableWakeUpPin2(void)
{
  STM32_CLEAR_BIT(PWR->WUCR, LL_PWR_WAKEUP_PIN_2);
}

#if defined(PWR_WUCR_WUPEN3)
/**
  * @brief  Disable the wake up pin 3.
  * @rmtoll
  *  WUCR    WUPEN3       LL_PWR_DisableWakeUpPin3
  */
__STATIC_INLINE void LL_PWR_DisableWakeUpPin3(void)
{
  STM32_CLEAR_BIT(PWR->WUCR, LL_PWR_WAKEUP_PIN_3);
}
#endif /* PWR_WUCR_WUPEN3 */

/**
  * @brief  Disable the wake up pin 4.
  * @rmtoll
  *  WUCR    WUPEN4       LL_PWR_DisableWakeUpPin4
  */
__STATIC_INLINE void LL_PWR_DisableWakeUpPin4(void)
{
  STM32_CLEAR_BIT(PWR->WUCR, LL_PWR_WAKEUP_PIN_4);
}

/**
  * @brief  Disable the wake up pin 5.
  * @rmtoll
  *  WUCR    WUPEN5       LL_PWR_DisableWakeUpPin5
  */
__STATIC_INLINE void LL_PWR_DisableWakeUpPin5(void)
{
  STM32_CLEAR_BIT(PWR->WUCR, LL_PWR_WAKEUP_PIN_5);
}

#if defined(PWR_WUCR_WUPEN6)
/**
  * @brief  Disable the wake up pin 6.
  * @rmtoll
  *  WUCR    WUPEN6       LL_PWR_DisableWakeUpPin6
  */
__STATIC_INLINE void LL_PWR_DisableWakeUpPin6(void)
{
  STM32_CLEAR_BIT(PWR->WUCR, LL_PWR_WAKEUP_PIN_6);
}
#endif /* PWR_WUCR_WUPEN6 */

#if defined(PWR_WUCR_WUPEN7)
/**
  * @brief  Disable the wake up pin 7.
  * @rmtoll
  *  WUCR    WUPEN7       LL_PWR_DisableWakeUpPin7
  */
__STATIC_INLINE void LL_PWR_DisableWakeUpPin7(void)
{
  STM32_CLEAR_BIT(PWR->WUCR, LL_PWR_WAKEUP_PIN_7);
}
#endif /* PWR_WUCR_WUPEN7 */

/**
  * @brief  Disable the wake up pin_x.
  * @rmtoll
  *  WUCR    WUPENx       LL_PWR_DisableWakeUpPin
  * @param  wakeup_pin This parameter can be a combination of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN_1
  *         @arg @ref LL_PWR_WAKEUP_PIN_2
#if PWR_WUCR_WUPEN3
  *         @arg @ref LL_PWR_WAKEUP_PIN_3
#endif
  *         @arg @ref LL_PWR_WAKEUP_PIN_4
  *         @arg @ref LL_PWR_WAKEUP_PIN_5
#if PWR_WUCR_WUPEN6
  *         @arg @ref LL_PWR_WAKEUP_PIN_6
#endif
#if PWR_WUCR_WUPEN7
  *         @arg @ref LL_PWR_WAKEUP_PIN_7
#endif
  */
__STATIC_INLINE void LL_PWR_DisableWakeUpPin(uint32_t wakeup_pin)
{
  STM32_CLEAR_BIT(PWR->WUCR, wakeup_pin);
}

/**
  * @brief  Check if the wake up pin 1 is enabled.
  * @rmtoll
  *  WUCR    WUPEN1       LL_PWR_IsEnabledWakeUpPin1
  * @return State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledWakeUpPin1(void)
{
  return ((STM32_READ_BIT(PWR->WUCR, LL_PWR_WAKEUP_PIN_1) == (LL_PWR_WAKEUP_PIN_1)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the wake up pin 2 is enabled.
  * @rmtoll
  *  WUCR    WUPEN2       LL_PWR_IsEnabledWakeUpPin2
  * @return State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledWakeUpPin2(void)
{
  return ((STM32_READ_BIT(PWR->WUCR, LL_PWR_WAKEUP_PIN_2) == (LL_PWR_WAKEUP_PIN_2)) ? 1UL : 0UL);
}

#if defined(PWR_WUCR_WUPEN3)
/**
  * @brief  Check if the wake up pin 3 is enabled.
  * @rmtoll
  *  WUCR    WUPEN3       LL_PWR_IsEnabledWakeUpPin3
  * @return State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledWakeUpPin3(void)
{
  return ((STM32_READ_BIT(PWR->WUCR, LL_PWR_WAKEUP_PIN_3) == (LL_PWR_WAKEUP_PIN_3)) ? 1UL : 0UL);
}
#endif /* PWR_WUCR_WUPEN3 */

/**
  * @brief  Check if the wake up pin 4 is enabled.
  * @rmtoll
  *  WUCR    WUPEN4       LL_PWR_IsEnabledWakeUpPin4
  * @return State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledWakeUpPin4(void)
{
  return ((STM32_READ_BIT(PWR->WUCR, LL_PWR_WAKEUP_PIN_4) == (LL_PWR_WAKEUP_PIN_4)) ? 1UL : 0UL);
}

/**
  * @brief  Check if the wake up pin 5 is enabled.
  * @rmtoll
  *  WUCR    WUPEN5       LL_PWR_IsEnabledWakeUpPin5
  * @return State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledWakeUpPin5(void)
{
  return ((STM32_READ_BIT(PWR->WUCR, LL_PWR_WAKEUP_PIN_5) == (LL_PWR_WAKEUP_PIN_5)) ? 1UL : 0UL);
}

#if defined(PWR_WUCR_WUPEN6)
/**
  * @brief  Check if the wake up pin 6 is enabled.
  * @rmtoll
  *  WUCR    WUPEN6       LL_PWR_IsEnabledWakeUpPin6
  * @return State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledWakeUpPin6(void)
{
  return ((STM32_READ_BIT(PWR->WUCR, LL_PWR_WAKEUP_PIN_6) == (LL_PWR_WAKEUP_PIN_6)) ? 1UL : 0UL);
}
#endif /* PWR_WUCR_WUPEN6 */

#if defined(PWR_WUCR_WUPEN7)
/**
  * @brief  Check if the wake up pin 7 is enabled.
  * @rmtoll
  *  WUCR    WUPEN7       LL_PWR_IsEnabledWakeUpPin7
  * @return State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledWakeUpPin7(void)
{
  return ((STM32_READ_BIT(PWR->WUCR, LL_PWR_WAKEUP_PIN_7) == (LL_PWR_WAKEUP_PIN_7)) ? 1UL : 0UL);
}
#endif /* PWR_WUCR_WUPEN7 */

/**
  * @brief  Check if the wake up pin_x is enabled.
  * @rmtoll
  *  WUCR    WUPENx       LL_PWR_IsEnabledWakeUpPin
  * @param  wakeup_pin This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN_1
  *         @arg @ref LL_PWR_WAKEUP_PIN_2
#if PWR_WUCR_WUPEN3
  *         @arg @ref LL_PWR_WAKEUP_PIN_3
#endif
  *         @arg @ref LL_PWR_WAKEUP_PIN_4
  *         @arg @ref LL_PWR_WAKEUP_PIN_5
#if PWR_WUCR_WUPEN6
  *         @arg @ref LL_PWR_WAKEUP_PIN_6
#endif
#if PWR_WUCR_WUPEN7
  *         @arg @ref LL_PWR_WAKEUP_PIN_7
#endif
  * @return State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledWakeUpPin(uint32_t wakeup_pin)
{
  return ((STM32_READ_BIT(PWR->WUCR, wakeup_pin) == (wakeup_pin)) ? 1UL : 0UL);
}

/**
  * @brief  Set the wake up pin 1 polarity low for the event detection.
  * @rmtoll
  *  WUCR          WUPP1       LL_PWR_SetWakeUpPin1PolarityLow
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPin1PolarityLow(void)
{
  STM32_SET_BIT(PWR->WUCR, (uint32_t)(LL_PWR_WAKEUP_PIN_1 << PWR_WUCR_WUPP1_Pos));
}

/**
  * @brief  Set the wake up pin 2 polarity low for the event detection.
  * @rmtoll
  *  WUCR          WUPP2       LL_PWR_SetWakeUpPin2PolarityLow
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPin2PolarityLow(void)
{
  STM32_SET_BIT(PWR->WUCR, (uint32_t)(LL_PWR_WAKEUP_PIN_2 << PWR_WUCR_WUPP1_Pos));
}

#if defined(PWR_WUCR_WUPEN3)
/**
  * @brief  Set the wake up pin 3 polarity low for the event detection.
  * @rmtoll
  *  WUCR          WUPP3       LL_PWR_SetWakeUpPin3PolarityLow
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPin3PolarityLow(void)
{
  STM32_SET_BIT(PWR->WUCR, (uint32_t)(LL_PWR_WAKEUP_PIN_3 << PWR_WUCR_WUPP1_Pos));
}
#endif /* PWR_WUCR_WUPEN3 */

/**
  * @brief  Set the wake up pin 4 polarity low for the event detection.
  * @rmtoll
  *  WUCR          WUPP4       LL_PWR_SetWakeUpPin4PolarityLow
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPin4PolarityLow(void)
{
  STM32_SET_BIT(PWR->WUCR, (uint32_t)(LL_PWR_WAKEUP_PIN_4 << PWR_WUCR_WUPP1_Pos));
}

/**
  * @brief  Set the wake up pin 5 polarity low for the event detection.
  * @rmtoll
  *  WUCR          WUPP5       LL_PWR_SetWakeUpPin5PolarityLow
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPin5PolarityLow(void)
{
  STM32_SET_BIT(PWR->WUCR, (uint32_t)(LL_PWR_WAKEUP_PIN_5 << PWR_WUCR_WUPP1_Pos));
}

#if defined(PWR_WUCR_WUPEN6)
/**
  * @brief  Set the wake up pin 6 polarity low for the event detection.
  * @rmtoll
  *  WUCR          WUPP6       LL_PWR_SetWakeUpPin6PolarityLow
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPin6PolarityLow(void)
{
  STM32_SET_BIT(PWR->WUCR, (uint32_t)(LL_PWR_WAKEUP_PIN_6 << PWR_WUCR_WUPP1_Pos));
}
#endif /* PWR_WUCR_WUPEN6 */

#if defined(PWR_WUCR_WUPEN7)
/**
  * @brief  Set the wake up pin 7 polarity low for the event detection.
  * @rmtoll
  *  WUCR          WUPP7       LL_PWR_SetWakeUpPin7PolarityLow
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPin7PolarityLow(void)
{
  STM32_SET_BIT(PWR->WUCR, (uint32_t)(LL_PWR_WAKEUP_PIN_7 << PWR_WUCR_WUPP1_Pos));
}
#endif /* PWR_WUCR_WUPEN7 */

/**
  * @brief  Set the wake up pin polarity low for the event detection.
  * @rmtoll
  *  WUCR          WUPPx       LL_PWR_SetWakeUpPinPolarityLow
  * @param  wakeup_pin This parameter can be a combination of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN_1
  *         @arg @ref LL_PWR_WAKEUP_PIN_2
#if PWR_WUCR_WUPEN3
  *         @arg @ref LL_PWR_WAKEUP_PIN_3
#endif
  *         @arg @ref LL_PWR_WAKEUP_PIN_4
  *         @arg @ref LL_PWR_WAKEUP_PIN_5
#if PWR_WUCR_WUPEN6
  *         @arg @ref LL_PWR_WAKEUP_PIN_6
#endif
#if PWR_WUCR_WUPEN7
  *         @arg @ref LL_PWR_WAKEUP_PIN_7
#endif
  *         @arg @ref LL_PWR_WAKEUP_PIN_ALL
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPinPolarityLow(uint32_t wakeup_pin)
{
  STM32_SET_BIT(PWR->WUCR, (uint32_t)(wakeup_pin << PWR_WUCR_WUPP1_Pos));
}

