MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_pwr.h
/**
  * @brief  Set the wake up pin 1 polarity high for the event detection.
  * @rmtoll
  *  WUCR          WUPP1       LL_PWR_SetWakeUpPin1PolarityHigh
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPin1PolarityHigh(void)
{
  STM32_CLEAR_BIT(PWR->WUCR, (uint32_t)(LL_PWR_WAKEUP_PIN_1 << PWR_WUCR_WUPP1_Pos));
}

/**
  * @brief  Set the wake up pin 2 polarity high for the event detection.
  * @rmtoll
  *  WUCR          WUPP2       LL_PWR_SetWakeUpPin2PolarityHigh
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPin2PolarityHigh(void)
{
  STM32_CLEAR_BIT(PWR->WUCR, (uint32_t)(LL_PWR_WAKEUP_PIN_2 << PWR_WUCR_WUPP1_Pos));
}

#if defined(PWR_WUCR_WUPEN3)
/**
  * @brief  Set the wake up pin 3 polarity high for the event detection.
  * @rmtoll
  *  WUCR          WUPP3       LL_PWR_SetWakeUpPin3PolarityHigh
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPin3PolarityHigh(void)
{
  STM32_CLEAR_BIT(PWR->WUCR, (uint32_t)(LL_PWR_WAKEUP_PIN_3 << PWR_WUCR_WUPP1_Pos));
}
#endif /* PWR_WUCR_WUPEN3 */

/**
  * @brief  Set the wake up pin 4 polarity high for the event detection.
  * @rmtoll
  *  WUCR          WUPP4       LL_PWR_SetWakeUpPin4PolarityHigh
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPin4PolarityHigh(void)
{
  STM32_CLEAR_BIT(PWR->WUCR, (uint32_t)(LL_PWR_WAKEUP_PIN_4 << PWR_WUCR_WUPP1_Pos));
}

/**
  * @brief  Set the wake up pin 5 polarity high for the event detection.
  * @rmtoll
  *  WUCR          WUPP5       LL_PWR_SetWakeUpPin5PolarityHigh
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPin5PolarityHigh(void)
{
  STM32_CLEAR_BIT(PWR->WUCR, (uint32_t)(LL_PWR_WAKEUP_PIN_5 << PWR_WUCR_WUPP1_Pos));
}

#if defined(PWR_WUCR_WUPEN6)
/**
  * @brief  Set the wake up pin 6 polarity high for the event detection.
  * @rmtoll
  *  WUCR          WUPP6       LL_PWR_SetWakeUpPin6PolarityHigh
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPin6PolarityHigh(void)
{
  STM32_CLEAR_BIT(PWR->WUCR, (uint32_t)(LL_PWR_WAKEUP_PIN_6 << PWR_WUCR_WUPP1_Pos));
}
#endif /* PWR_WUCR_WUPEN6 */

#if defined(PWR_WUCR_WUPEN7)
/**
  * @brief  Set the wake up pin 7 polarity high for the event detection.
  * @rmtoll
  *  WUCR          WUPP7       LL_PWR_SetWakeUpPin7PolarityHigh
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPin7PolarityHigh(void)
{
  STM32_CLEAR_BIT(PWR->WUCR, (uint32_t)(LL_PWR_WAKEUP_PIN_7 << PWR_WUCR_WUPP1_Pos));
}
#endif /* PWR_WUCR_WUPEN7 */

/**
  * @brief  Set the wake up pin polarity high for the event detection.
  * @rmtoll
  *  WUCR          WUPPx       LL_PWR_SetWakeUpPinPolarityHigh
  * @param  wakeup_pin This parameter can be a combination of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN_1
  *         @arg @ref LL_PWR_WAKEUP_PIN_2
#if PWR_WUCR_WUPEN3
  *         @arg @ref LL_PWR_WAKEUP_PIN_3
#endif
  *         @arg @ref LL_PWR_WAKEUP_PIN_4
  *         @arg @ref LL_PWR_WAKEUP_PIN_5
#if PWR_WUCR_WUPEN6
  *         @arg @ref LL_PWR_WAKEUP_PIN_6
#endif
#if PWR_WUCR_WUPEN7
  *         @arg @ref LL_PWR_WAKEUP_PIN_7
#endif
  *         @arg @ref LL_PWR_WAKEUP_PIN_ALL
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPinPolarityHigh(uint32_t wakeup_pin)
{
  STM32_CLEAR_BIT(PWR->WUCR, (uint32_t)(wakeup_pin << PWR_WUCR_WUPP1_Pos));
}

/**
  * @brief  Set the wake up pin 1 polarity for the event detection.
  * @rmtoll
  *  WUCR          WUPP1       LL_PWR_SetWakeUpPin1Polarity
  * @param  polarity This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN_POLARITY_HIGH
  *         @arg @ref LL_PWR_WAKEUP_PIN_POLARITY_LOW
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPin1Polarity(uint32_t polarity)
{
  STM32_MODIFY_REG(PWR->WUCR, PWR_WUCR_WUPP1, (uint32_t)(polarity << PWR_WUCR_WUPP1_Pos));
}

/**
  * @brief  Set the wake up pin 2 polarity for the event detection.
  * @rmtoll
  *  WUCR          WUPP2       LL_PWR_SetWakeUpPin2Polarity
  * @param  polarity This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN_POLARITY_HIGH
  *         @arg @ref LL_PWR_WAKEUP_PIN_POLARITY_LOW
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPin2Polarity(uint32_t polarity)
{
  STM32_MODIFY_REG(PWR->WUCR, PWR_WUCR_WUPP2, (uint32_t)(polarity << PWR_WUCR_WUPP2_Pos));
}

#if defined(PWR_WUCR_WUPEN3)
/**
  * @brief  Set the wake up pin 3 polarity for the event detection.
  * @rmtoll
  *  WUCR          WUPP3       LL_PWR_SetWakeUpPin3Polarity
  * @param  polarity This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN_POLARITY_HIGH
  *         @arg @ref LL_PWR_WAKEUP_PIN_POLARITY_LOW
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPin3Polarity(uint32_t polarity)
{
  STM32_MODIFY_REG(PWR->WUCR, PWR_WUCR_WUPP3, (uint32_t)(polarity << PWR_WUCR_WUPP3_Pos));
}
#endif /* PWR_WUCR_WUPEN3 */

/**
  * @brief  Set the wake up pin 4 polarity for the event detection.
  * @rmtoll
  *  WUCR          WUPP4       LL_PWR_SetWakeUpPin4Polarity
  * @param  polarity This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN_POLARITY_HIGH
  *         @arg @ref LL_PWR_WAKEUP_PIN_POLARITY_LOW
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPin4Polarity(uint32_t polarity)
{
  STM32_MODIFY_REG(PWR->WUCR, PWR_WUCR_WUPP4, (uint32_t)(polarity << PWR_WUCR_WUPP4_Pos));
}

/**
  * @brief  Set the wake up pin 5 polarity for the event detection.
  * @rmtoll
  *  WUCR          WUPP5       LL_PWR_SetWakeUpPin5Polarity
  * @param  polarity This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN_POLARITY_HIGH
  *         @arg @ref LL_PWR_WAKEUP_PIN_POLARITY_LOW
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPin5Polarity(uint32_t polarity)
{
  STM32_MODIFY_REG(PWR->WUCR, PWR_WUCR_WUPP5, (uint32_t)(polarity << PWR_WUCR_WUPP5_Pos));
}

#if defined(PWR_WUCR_WUPEN6)
/**
  * @brief  Set the wake up pin 6 polarity for the event detection.
  * @rmtoll
  *  WUCR          WUPP6       LL_PWR_SetWakeUpPin6Polarity
  * @param  polarity This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN_POLARITY_HIGH
  *         @arg @ref LL_PWR_WAKEUP_PIN_POLARITY_LOW
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPin6Polarity(uint32_t polarity)
{
  STM32_MODIFY_REG(PWR->WUCR, PWR_WUCR_WUPP6, (uint32_t)(polarity << PWR_WUCR_WUPP6_Pos));
}
#endif /* PWR_WUCR_WUPEN6 */

#if defined(PWR_WUCR_WUPEN7)
/**
  * @brief  Set the wake up pin 7 polarity for the event detection.
  * @rmtoll
  *  WUCR          WUPP7       LL_PWR_SetWakeUpPin7Polarity
  * @param  polarity This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN_POLARITY_HIGH
  *         @arg @ref LL_PWR_WAKEUP_PIN_POLARITY_LOW
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPin7Polarity(uint32_t polarity)
{
  STM32_MODIFY_REG(PWR->WUCR, PWR_WUCR_WUPP7, (uint32_t)(polarity << PWR_WUCR_WUPP7_Pos));
}
#endif /* PWR_WUCR_WUPEN7 */

/**
  * @brief  Set the wake up pin polarity for the event detection.
  * @rmtoll
  *  WUCR          WUPPx       LL_PWR_SetWakeUpPinPolarity
  * @param  wakeup_pin This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN_1
  *         @arg @ref LL_PWR_WAKEUP_PIN_2
#if PWR_WUCR_WUPEN3
  *         @arg @ref LL_PWR_WAKEUP_PIN_3
#endif
  *         @arg @ref LL_PWR_WAKEUP_PIN_4
  *         @arg @ref LL_PWR_WAKEUP_PIN_5
#if PWR_WUCR_WUPEN6
  *         @arg @ref LL_PWR_WAKEUP_PIN_6
#endif
#if PWR_WUCR_WUPEN7
  *         @arg @ref LL_PWR_WAKEUP_PIN_7
#endif
  * @param  polarity This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN_POLARITY_HIGH
  *         @arg @ref LL_PWR_WAKEUP_PIN_POLARITY_LOW
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPinPolarity(uint32_t wakeup_pin, uint32_t polarity)
{
  STM32_MODIFY_REG(PWR->WUCR, (uint32_t)(PWR_WUCR_WUPP1 << STM32_POSITION_VAL(wakeup_pin)), \
                   (uint32_t)(polarity << (PWR_WUCR_WUPP1_Pos + STM32_POSITION_VAL(wakeup_pin))));
}

/**
  * @brief  Get the wake up pin 1 polarity for the event detection.
  * @rmtoll
  *  WUCR          WUPP1       LL_PWR_GetWakeUpPin1Polarity
  * @return State of bit (1 : polarity low or 0 : polarity high).
  */
__STATIC_INLINE uint32_t LL_PWR_GetWakeUpPin1Polarity(void)
{
  return (((STM32_READ_BIT(PWR->WUCR, PWR_WUCR_WUPP1)) != 0U) ? 1UL : 0UL);
}

/**
  * @brief  Get the wake up pin 2 polarity for the event detection.
  * @rmtoll
  *  WUCR          WUPP2       LL_PWR_GetWakeUpPin2Polarity
  * @return State of bit (1 : polarity low or 0 : polarity high).
  */
__STATIC_INLINE uint32_t LL_PWR_GetWakeUpPin2Polarity(void)
{
  return (((STM32_READ_BIT(PWR->WUCR, PWR_WUCR_WUPP2)) != 0U) ? 1UL : 0UL);
}

#if defined(PWR_WUCR_WUPEN3)
/**
  * @brief  Get the wake up pin 3 polarity for the event detection.
  * @rmtoll
  *  WUCR          WUPP3       LL_PWR_GetWakeUpPin3Polarity
  * @return State of bit (1 : polarity low or 0 : polarity high).
  */
__STATIC_INLINE uint32_t LL_PWR_GetWakeUpPin3Polarity(void)
{
  return (((STM32_READ_BIT(PWR->WUCR, PWR_WUCR_WUPP3)) != 0U) ? 1UL : 0UL);
}
#endif /* PWR_WUCR_WUPEN3 */

/**
  * @brief  Get the wake up pin 4 polarity for the event detection.
  * @rmtoll
  *  WUCR          WUPP4       LL_PWR_GetWakeUpPin4Polarity
  * @return State of bit (1 : polarity low or 0 : polarity high).
  */
__STATIC_INLINE uint32_t LL_PWR_GetWakeUpPin4Polarity(void)
{
  return (((STM32_READ_BIT(PWR->WUCR, PWR_WUCR_WUPP4)) != 0U) ? 1UL : 0UL);
}

/**
  * @brief  Get the wake up pin 5 polarity for the event detection.
  * @rmtoll
  *  WUCR          WUPP5       LL_PWR_GetWakeUpPin5Polarity
  * @return State of bit (1 : polarity low or 0 : polarity high).
  */
__STATIC_INLINE uint32_t LL_PWR_GetWakeUpPin5Polarity(void)
{
  return (((STM32_READ_BIT(PWR->WUCR, PWR_WUCR_WUPP5)) != 0U) ? 1UL : 0UL);
}

#if defined(PWR_WUCR_WUPEN6)
/**
  * @brief  Get the wake up pin 6 polarity for the event detection.
  * @rmtoll
  *  WUCR          WUPP6       LL_PWR_GetWakeUpPin6Polarity
  * @return State of bit (1 : polarity low or 0 : polarity high).
  */
__STATIC_INLINE uint32_t LL_PWR_GetWakeUpPin6Polarity(void)
{
  return (((STM32_READ_BIT(PWR->WUCR, PWR_WUCR_WUPP6)) != 0U) ? 1UL : 0UL);
}
#endif /* PWR_WUCR_WUPEN6 */

#if defined(PWR_WUCR_WUPEN7)
/**
  * @brief  Get the wake up pin 7 polarity for the event detection.
  * @rmtoll
  *  WUCR          WUPP7       LL_PWR_GetWakeUpPin7Polarity
  * @return State of bit (1 : polarity low or 0 : polarity high).
  */
__STATIC_INLINE uint32_t LL_PWR_GetWakeUpPin7Polarity(void)
{
  return (((STM32_READ_BIT(PWR->WUCR, PWR_WUCR_WUPP7)) != 0U) ? 1UL : 0UL);
}
#endif /* PWR_WUCR_WUPEN7 */

/**
  * @brief  Get the wake up pin polarity for the event detection.
  * @rmtoll
  *  WUCR          WUPPx       LL_PWR_GetWakeUpPinPolarity
  * @param  wakeup_pin This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN_1
  *         @arg @ref LL_PWR_WAKEUP_PIN_2
#if PWR_WUCR_WUPEN3
  *         @arg @ref LL_PWR_WAKEUP_PIN_3
#endif
  *         @arg @ref LL_PWR_WAKEUP_PIN_4
  *         @arg @ref LL_PWR_WAKEUP_PIN_5
#if PWR_WUCR_WUPEN6
  *         @arg @ref LL_PWR_WAKEUP_PIN_6
#endif
#if PWR_WUCR_WUPEN7
  *         @arg @ref LL_PWR_WAKEUP_PIN_7
#endif
  * @return State of bit (1 : polarity low or 0 : polarity high).
  */
__STATIC_INLINE uint32_t LL_PWR_GetWakeUpPinPolarity(uint32_t wakeup_pin)
{
  return (((STM32_READ_BIT(PWR->WUCR, (uint32_t)(PWR_WUCR_WUPP1 << STM32_POSITION_VAL(wakeup_pin)))) != 0U) \
          ? 1UL : 0UL);
}

/**
  * @brief  Set the Wake-Up pin 1 Pull None.
  * @rmtoll
  *  WUCR   WUPPUPD1       LL_PWR_SetWakeUpPin1PullNone
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPin1PullNone(void)
{
  STM32_MODIFY_REG(PWR->WUCR, PWR_WUCR_WUPPUPD1, (LL_PWR_WAKEUP_PIN_PULL_NO << PWR_WUCR_WUPPUPD1_Pos));
}

/**
  * @brief  Set the Wake-Up pin 2 Pull None.
  * @rmtoll
  *  WUCR   WUPPUPD2       LL_PWR_SetWakeUpPin2PullNone
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPin2PullNone(void)
{
  STM32_MODIFY_REG(PWR->WUCR, PWR_WUCR_WUPPUPD2, (LL_PWR_WAKEUP_PIN_PULL_NO << PWR_WUCR_WUPPUPD2_Pos));
}

#if defined(PWR_WUCR_WUPEN3)
/**
  * @brief  Set the Wake-Up pin 3 Pull None.
  * @rmtoll
  *  WUCR   WUPPUPD3       LL_PWR_SetWakeUpPin3PullNone
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPin3PullNone(void)
{
  STM32_MODIFY_REG(PWR->WUCR, PWR_WUCR_WUPPUPD3, (LL_PWR_WAKEUP_PIN_PULL_NO << PWR_WUCR_WUPPUPD3_Pos));
}
#endif /* PWR_WUCR_WUPEN3 */

/**
  * @brief  Set the Wake-Up pin 4 Pull None.
  * @rmtoll
  *  WUCR   WUPPUPD4       LL_PWR_SetWakeUpPin4PullNone
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPin4PullNone(void)
{
  STM32_MODIFY_REG(PWR->WUCR, PWR_WUCR_WUPPUPD4, (LL_PWR_WAKEUP_PIN_PULL_NO << PWR_WUCR_WUPPUPD4_Pos));
}

/**
  * @brief  Set the Wake-Up pin 5 Pull None.
  * @rmtoll
  *  WUCR   WUPPUPD5       LL_PWR_SetWakeUpPin5PullNone
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPin5PullNone(void)
{
  STM32_MODIFY_REG(PWR->WUCR, PWR_WUCR_WUPPUPD5, (LL_PWR_WAKEUP_PIN_PULL_NO << PWR_WUCR_WUPPUPD5_Pos));
}

#if defined(PWR_WUCR_WUPEN6)
/**
  * @brief  Set the Wake-Up pin 6 Pull None.
  * @rmtoll
  *  WUCR   WUPPUPD6       LL_PWR_SetWakeUpPin6PullNone
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPin6PullNone(void)
{
  STM32_MODIFY_REG(PWR->WUCR, PWR_WUCR_WUPPUPD6, (LL_PWR_WAKEUP_PIN_PULL_NO << PWR_WUCR_WUPPUPD6_Pos));
}
#endif /* PWR_WUCR_WUPEN6 */

#if defined(PWR_WUCR_WUPEN7)
/**
  * @brief  Set the Wake-Up pin 7 Pull None.
  * @rmtoll
  *  WUCR   WUPPUPD7       LL_PWR_SetWakeUpPin7PullNone
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPin7PullNone(void)
{
  STM32_MODIFY_REG(PWR->WUCR, PWR_WUCR_WUPPUPD7, (LL_PWR_WAKEUP_PIN_PULL_NO << PWR_WUCR_WUPPUPD7_Pos));
}
#endif /* PWR_WUCR_WUPEN7 */

/**
  * @brief  Set the Wake-Up pin Pull None.
  * @rmtoll
  *  WUCR   WUPPUPDx       LL_PWR_SetWakeUpPinPullNone
  * @param  wakeup_pin This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN_1
  *         @arg @ref LL_PWR_WAKEUP_PIN_2
#if PWR_WUCR_WUPEN3
  *         @arg @ref LL_PWR_WAKEUP_PIN_3
#endif
  *         @arg @ref LL_PWR_WAKEUP_PIN_4
  *         @arg @ref LL_PWR_WAKEUP_PIN_5
#if PWR_WUCR_WUPEN6
  *         @arg @ref LL_PWR_WAKEUP_PIN_6
#endif
#if PWR_WUCR_WUPEN7
  *         @arg @ref LL_PWR_WAKEUP_PIN_7
#endif
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPinPullNone(uint32_t wakeup_pin)
{
  STM32_MODIFY_REG(PWR->WUCR,
                   (PWR_WUCR_WUPPUPD1 << ((LL_PWR_WAKEUP_PINS_PULL_SHIFT_OFFSET * (STM32_POSITION_VAL(wakeup_pin) & \
                                           0xFU)) & \
                                          LL_PWR_WAKEUP_PINS_MAX_SHIFT_MASK)),
                   (LL_PWR_WAKEUP_PIN_PULL_NO << ((PWR_WUCR_WUPPUPD1_Pos + ((LL_PWR_WAKEUP_PINS_PULL_SHIFT_OFFSET * \
                                                                             STM32_POSITION_VAL(wakeup_pin)) & 0xFU)) &\
                                                  LL_PWR_WAKEUP_PINS_MAX_SHIFT_MASK)));
}

/**
  * @brief  Set the Wake-Up pin 1 Pull Up.
  * @rmtoll
  *  WUCR   WUPPUPD1       LL_PWR_SetWakeUpPin1PullUp
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPin1PullUp(void)
{
  STM32_MODIFY_REG(PWR->WUCR, PWR_WUCR_WUPPUPD1, (LL_PWR_WAKEUP_PIN_PULL_UP << PWR_WUCR_WUPPUPD1_Pos));
}

/**
  * @brief  Set the Wake-Up pin 2 Pull Up.
  * @rmtoll
  *  WUCR   WUPPUPD2       LL_PWR_SetWakeUpPin2PullUp
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPin2PullUp(void)
{
  STM32_MODIFY_REG(PWR->WUCR, PWR_WUCR_WUPPUPD2, (LL_PWR_WAKEUP_PIN_PULL_UP << PWR_WUCR_WUPPUPD2_Pos));
}

#if defined(PWR_WUCR_WUPEN3)
/**
  * @brief  Set the Wake-Up pin 3 Pull Up.
  * @rmtoll
  *  WUCR   WUPPUPD3       LL_PWR_SetWakeUpPin3PullUp
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPin3PullUp(void)
{
  STM32_MODIFY_REG(PWR->WUCR, PWR_WUCR_WUPPUPD3, (LL_PWR_WAKEUP_PIN_PULL_UP << PWR_WUCR_WUPPUPD3_Pos));
}
#endif /* PWR_WUCR_WUPEN3 */

/**
  * @brief  Set the Wake-Up pin 4 Pull Up.
  * @rmtoll
  *  WUCR   WUPPUPD4       LL_PWR_SetWakeUpPin4PullUp
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPin4PullUp(void)
{
  STM32_MODIFY_REG(PWR->WUCR, PWR_WUCR_WUPPUPD4, (LL_PWR_WAKEUP_PIN_PULL_UP << PWR_WUCR_WUPPUPD4_Pos));
}

/**
  * @brief  Set the Wake-Up pin 5 Pull Up.
  * @rmtoll
  *  WUCR   WUPPUPD5       LL_PWR_SetWakeUpPin5PullUp
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPin5PullUp(void)
{
  STM32_MODIFY_REG(PWR->WUCR, PWR_WUCR_WUPPUPD5, (LL_PWR_WAKEUP_PIN_PULL_UP << PWR_WUCR_WUPPUPD5_Pos));
}

#if defined(PWR_WUCR_WUPEN6)
/**
  * @brief  Set the Wake-Up pin 6 Pull Up.
  * @rmtoll
  *  WUCR   WUPPUPD6       LL_PWR_SetWakeUpPin6PullUp
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPin6PullUp(void)
{
  STM32_MODIFY_REG(PWR->WUCR, PWR_WUCR_WUPPUPD6, (LL_PWR_WAKEUP_PIN_PULL_UP << PWR_WUCR_WUPPUPD6_Pos));
}
#endif /* PWR_WUCR_WUPEN6 */

#if defined(PWR_WUCR_WUPEN7)
/**
  * @brief  Set the Wake-Up pin 7 Pull Up.
  * @rmtoll
  *  WUCR   WUPPUPD7       LL_PWR_SetWakeUpPin7PullUp
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPin7PullUp(void)
{
  STM32_MODIFY_REG(PWR->WUCR, PWR_WUCR_WUPPUPD7, (LL_PWR_WAKEUP_PIN_PULL_UP << PWR_WUCR_WUPPUPD7_Pos));
}
#endif /* PWR_WUCR_WUPEN7 */

/**
  * @brief  Set the Wake-Up pin Pull Up.
  * @rmtoll
  *  WUCR   WUPPUPDx       LL_PWR_SetWakeUpPinPullUp
  * @param  wakeup_pin This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN_1
  *         @arg @ref LL_PWR_WAKEUP_PIN_2
#if PWR_WUCR_WUPEN3
  *         @arg @ref LL_PWR_WAKEUP_PIN_3
#endif
  *         @arg @ref LL_PWR_WAKEUP_PIN_4
  *         @arg @ref LL_PWR_WAKEUP_PIN_5
#if PWR_WUCR_WUPEN6
  *         @arg @ref LL_PWR_WAKEUP_PIN_6
#endif
#if PWR_WUCR_WUPEN7
  *         @arg @ref LL_PWR_WAKEUP_PIN_7
#endif
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPinPullUp(uint32_t wakeup_pin)
{
  STM32_MODIFY_REG(PWR->WUCR,
                   (PWR_WUCR_WUPPUPD1 << ((LL_PWR_WAKEUP_PINS_PULL_SHIFT_OFFSET * (STM32_POSITION_VAL(wakeup_pin) & \
                                           0xFU)) & \
                                          LL_PWR_WAKEUP_PINS_MAX_SHIFT_MASK)),
                   (LL_PWR_WAKEUP_PIN_PULL_UP << ((PWR_WUCR_WUPPUPD1_Pos + ((LL_PWR_WAKEUP_PINS_PULL_SHIFT_OFFSET * \
                                                                             STM32_POSITION_VAL(wakeup_pin)) & 0xFU)) &\
                                                  LL_PWR_WAKEUP_PINS_MAX_SHIFT_MASK)));
}

/**
  * @brief  Set the Wake-Up pin 1 Pull Down.
  * @rmtoll
  *  WUCR   WUPPUPD1       LL_PWR_SetWakeUpPin1PullDown
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPin1PullDown(void)
{
  STM32_MODIFY_REG(PWR->WUCR, PWR_WUCR_WUPPUPD1, (LL_PWR_WAKEUP_PIN_PULL_DOWN << PWR_WUCR_WUPPUPD1_Pos));
}

/**
  * @brief  Set the Wake-Up pin 2 Pull Down.
  * @rmtoll
  *  WUCR   WUPPUPD2       LL_PWR_SetWakeUpPin2PullDown
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPin2PullDown(void)
{
  STM32_MODIFY_REG(PWR->WUCR, PWR_WUCR_WUPPUPD2, (LL_PWR_WAKEUP_PIN_PULL_DOWN << PWR_WUCR_WUPPUPD2_Pos));
}

#if defined(PWR_WUCR_WUPEN3)
/**
  * @brief  Set the Wake-Up pin 3 Pull Down.
  * @rmtoll
  *  WUCR   WUPPUPD3       LL_PWR_SetWakeUpPin3PullDown
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPin3PullDown(void)
{
  STM32_MODIFY_REG(PWR->WUCR, PWR_WUCR_WUPPUPD3, (LL_PWR_WAKEUP_PIN_PULL_DOWN << PWR_WUCR_WUPPUPD3_Pos));
}
#endif /* PWR_WUCR_WUPEN3 */

/**
  * @brief  Set the Wake-Up pin 4 Pull Down.
  * @rmtoll
  *  WUCR   WUPPUPD4       LL_PWR_SetWakeUpPin4PullDown
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPin4PullDown(void)
{
  STM32_MODIFY_REG(PWR->WUCR, PWR_WUCR_WUPPUPD4, (LL_PWR_WAKEUP_PIN_PULL_DOWN << PWR_WUCR_WUPPUPD4_Pos));
}

/**
  * @brief  Set the Wake-Up pin 5 Pull Down.
  * @rmtoll
  *  WUCR   WUPPUPD5       LL_PWR_SetWakeUpPin5PullDown
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPin5PullDown(void)
{
  STM32_MODIFY_REG(PWR->WUCR, PWR_WUCR_WUPPUPD5, (LL_PWR_WAKEUP_PIN_PULL_DOWN << PWR_WUCR_WUPPUPD5_Pos));
}

#if defined(PWR_WUCR_WUPEN6)
/**
  * @brief  Set the Wake-Up pin 6 Pull Down.
  * @rmtoll
  *  WUCR   WUPPUPD6       LL_PWR_SetWakeUpPin6PullDown
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPin6PullDown(void)
{
  STM32_MODIFY_REG(PWR->WUCR, PWR_WUCR_WUPPUPD6, (LL_PWR_WAKEUP_PIN_PULL_DOWN << PWR_WUCR_WUPPUPD6_Pos));
}
#endif /* PWR_WUCR_WUPEN6 */

#if defined(PWR_WUCR_WUPEN7)
/**
  * @brief  Set the Wake-Up pin 7 Pull Down.
  * @rmtoll
  *  WUCR   WUPPUPD7       LL_PWR_SetWakeUpPin7PullDown
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPin7PullDown(void)
{
  STM32_MODIFY_REG(PWR->WUCR, PWR_WUCR_WUPPUPD7, (LL_PWR_WAKEUP_PIN_PULL_DOWN << PWR_WUCR_WUPPUPD7_Pos));
}
#endif /* PWR_WUCR_WUPEN7 */

/**
  * @brief  Set the Wake-Up pin Pull Down.
  * @rmtoll
  *  WUCR   WUPPUPDx       LL_PWR_SetWakeUpPinPullDown
  * @param  wakeup_pin This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN_1
  *         @arg @ref LL_PWR_WAKEUP_PIN_2
#if PWR_WUCR_WUPEN3
  *         @arg @ref LL_PWR_WAKEUP_PIN_3
#endif
  *         @arg @ref LL_PWR_WAKEUP_PIN_4
  *         @arg @ref LL_PWR_WAKEUP_PIN_5
#if PWR_WUCR_WUPEN6
  *         @arg @ref LL_PWR_WAKEUP_PIN_6
#endif
#if PWR_WUCR_WUPEN7
  *         @arg @ref LL_PWR_WAKEUP_PIN_7
#endif
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPinPullDown(uint32_t wakeup_pin)
{
  STM32_MODIFY_REG(PWR->WUCR,
                   (PWR_WUCR_WUPPUPD1 << ((LL_PWR_WAKEUP_PINS_PULL_SHIFT_OFFSET * (STM32_POSITION_VAL(wakeup_pin) & \
                                           0xFU)) & \
                                          LL_PWR_WAKEUP_PINS_MAX_SHIFT_MASK)),
                   (LL_PWR_WAKEUP_PIN_PULL_DOWN << ((PWR_WUCR_WUPPUPD1_Pos + ((LL_PWR_WAKEUP_PINS_PULL_SHIFT_OFFSET * \
                                                                               STM32_POSITION_VAL(wakeup_pin)) \
                                                                              & 0xFU)) & \
                                                    LL_PWR_WAKEUP_PINS_MAX_SHIFT_MASK)));
}

/**
  * @brief  Set the Wake-Up pin 1 pull.
  * @rmtoll
  *  WUCR   WUPPUPD1       LL_PWR_SetWakeUpPin1Pull
  * @param  pull This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN_PULL_NO
  *         @arg @ref LL_PWR_WAKEUP_PIN_PULL_UP
  *         @arg @ref LL_PWR_WAKEUP_PIN_PULL_DOWN
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPin1Pull(uint32_t pull)
{
  STM32_MODIFY_REG(PWR->WUCR, PWR_WUCR_WUPPUPD1, pull << PWR_WUCR_WUPPUPD1_Pos);
}

/**
  * @brief  Set the Wake-Up pin 2 pull.
  * @rmtoll
  *  WUCR   WUPPUPD2       LL_PWR_SetWakeUpPin2Pull
  * @param  pull This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN_PULL_NO
  *         @arg @ref LL_PWR_WAKEUP_PIN_PULL_UP
  *         @arg @ref LL_PWR_WAKEUP_PIN_PULL_DOWN
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPin2Pull(uint32_t pull)
{
  STM32_MODIFY_REG(PWR->WUCR, PWR_WUCR_WUPPUPD2, pull << PWR_WUCR_WUPPUPD2_Pos);
}

#if defined(PWR_WUCR_WUPEN3)
/**
  * @brief  Set the Wake-Up pin 3 pull.
  * @rmtoll
  *  WUCR   WUPPUPD3       LL_PWR_SetWakeUpPin3Pull
  * @param  pull This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN_PULL_NO
  *         @arg @ref LL_PWR_WAKEUP_PIN_PULL_UP
  *         @arg @ref LL_PWR_WAKEUP_PIN_PULL_DOWN
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPin3Pull(uint32_t pull)
{
  STM32_MODIFY_REG(PWR->WUCR, PWR_WUCR_WUPPUPD3, pull << PWR_WUCR_WUPPUPD3_Pos);
}
#endif /* PWR_WUCR_WUPEN3 */

/**
  * @brief  Set the Wake-Up pin 4 pull.
  * @rmtoll
  *  WUCR   WUPPUPD4       LL_PWR_SetWakeUpPin4Pull
  * @param  pull This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN_PULL_NO
  *         @arg @ref LL_PWR_WAKEUP_PIN_PULL_UP
  *         @arg @ref LL_PWR_WAKEUP_PIN_PULL_DOWN
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPin4Pull(uint32_t pull)
{
  STM32_MODIFY_REG(PWR->WUCR, PWR_WUCR_WUPPUPD4, pull << PWR_WUCR_WUPPUPD4_Pos);
}

