MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_pwr.h
/**
  * @brief  Set the Wake-Up pin 5 pull.
  * @rmtoll
  *  WUCR   WUPPUPD5       LL_PWR_SetWakeUpPin5Pull
  * @param  pull This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN_PULL_NO
  *         @arg @ref LL_PWR_WAKEUP_PIN_PULL_UP
  *         @arg @ref LL_PWR_WAKEUP_PIN_PULL_DOWN
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPin5Pull(uint32_t pull)
{
  STM32_MODIFY_REG(PWR->WUCR, PWR_WUCR_WUPPUPD5, pull << PWR_WUCR_WUPPUPD5_Pos);
}

#if defined(PWR_WUCR_WUPEN6)
/**
  * @brief  Set the Wake-Up pin 6 pull.
  * @rmtoll
  *  WUCR   WUPPUPD6       LL_PWR_SetWakeUpPin6Pull
  * @param  pull This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN_PULL_NO
  *         @arg @ref LL_PWR_WAKEUP_PIN_PULL_UP
  *         @arg @ref LL_PWR_WAKEUP_PIN_PULL_DOWN
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPin6Pull(uint32_t pull)
{
  STM32_MODIFY_REG(PWR->WUCR, PWR_WUCR_WUPPUPD6, pull << PWR_WUCR_WUPPUPD6_Pos);
}
#endif /* PWR_WUCR_WUPEN6 */

#if defined(PWR_WUCR_WUPEN7)
/**
  * @brief  Set the Wake-Up pin 7 pull.
  * @rmtoll
  *  WUCR   WUPPUPD7       LL_PWR_SetWakeUpPin7Pull
  * @param  pull This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN_PULL_NO
  *         @arg @ref LL_PWR_WAKEUP_PIN_PULL_UP
  *         @arg @ref LL_PWR_WAKEUP_PIN_PULL_DOWN
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPin7Pull(uint32_t pull)
{
  STM32_MODIFY_REG(PWR->WUCR, PWR_WUCR_WUPPUPD7, pull << PWR_WUCR_WUPPUPD7_Pos);
}
#endif /* PWR_WUCR_WUPEN7 */

/**
  * @brief  Set the Wake-Up pin pull.
  * @rmtoll
  *  WUCR   WUPPUPDx       LL_PWR_SetWakeUpPinPull
  * @param  wakeup_pin This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN_1
  *         @arg @ref LL_PWR_WAKEUP_PIN_2
#if PWR_WUCR_WUPEN3
  *         @arg @ref LL_PWR_WAKEUP_PIN_3
#endif
  *         @arg @ref LL_PWR_WAKEUP_PIN_4
  *         @arg @ref LL_PWR_WAKEUP_PIN_5
#if PWR_WUCR_WUPEN6
  *         @arg @ref LL_PWR_WAKEUP_PIN_6
#endif
#if PWR_WUCR_WUPEN7
  *         @arg @ref LL_PWR_WAKEUP_PIN_7
#endif
  * @param  pull This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN_PULL_NO
  *         @arg @ref LL_PWR_WAKEUP_PIN_PULL_UP
  *         @arg @ref LL_PWR_WAKEUP_PIN_PULL_DOWN
  */
__STATIC_INLINE void LL_PWR_SetWakeUpPinPull(uint32_t wakeup_pin, uint32_t pull)
{
  STM32_MODIFY_REG(PWR->WUCR, (PWR_WUCR_WUPPUPD1 << (LL_PWR_WAKEUP_PINS_PULL_SHIFT_OFFSET * \
                                                     (STM32_POSITION_VAL(wakeup_pin)))), \
                   pull << (PWR_WUCR_WUPPUPD1_Pos + \
                            (LL_PWR_WAKEUP_PINS_PULL_SHIFT_OFFSET * (STM32_POSITION_VAL(wakeup_pin)))));
}

/**
  * @brief  Get the Wake-Up pin 1 pull.
  * @rmtoll
  *  WUCR   WUPPUPD1       LL_PWR_GetWakeUpPin1Pull
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN_PULL_NO
  *         @arg @ref LL_PWR_WAKEUP_PIN_PULL_UP
  *         @arg @ref LL_PWR_WAKEUP_PIN_PULL_DOWN
  */
__STATIC_INLINE uint32_t LL_PWR_GetWakeUpPin1Pull(void)
{
  uint32_t regValue = STM32_READ_BIT(PWR->WUCR, PWR_WUCR_WUPPUPD1);

  return (uint32_t)(regValue >> PWR_WUCR_WUPPUPD1_Pos);
}

/**
  * @brief  Get the Wake-Up pin 2 pull.
  * @rmtoll
  *  WUCR   WUPPUPD2       LL_PWR_GetWakeUpPin2Pull
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN_PULL_NO
  *         @arg @ref LL_PWR_WAKEUP_PIN_PULL_UP
  *         @arg @ref LL_PWR_WAKEUP_PIN_PULL_DOWN
  */
__STATIC_INLINE uint32_t LL_PWR_GetWakeUpPin2Pull(void)
{
  uint32_t regValue = STM32_READ_BIT(PWR->WUCR, PWR_WUCR_WUPPUPD2);

  return (uint32_t)(regValue >> PWR_WUCR_WUPPUPD2_Pos);
}

#if defined(PWR_WUCR_WUPEN3)
/**
  * @brief  Get the Wake-Up pin 3 pull.
  * @rmtoll
  *  WUCR   WUPPUPD3       LL_PWR_GetWakeUpPin3Pull
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN_PULL_NO
  *         @arg @ref LL_PWR_WAKEUP_PIN_PULL_UP
  *         @arg @ref LL_PWR_WAKEUP_PIN_PULL_DOWN
  */
__STATIC_INLINE uint32_t LL_PWR_GetWakeUpPin3Pull(void)
{
  uint32_t regValue = STM32_READ_BIT(PWR->WUCR, PWR_WUCR_WUPPUPD3);

  return (uint32_t)(regValue >> PWR_WUCR_WUPPUPD3_Pos);
}
#endif /* PWR_WUCR_WUPEN3 */

/**
  * @brief  Get the Wake-Up pin 4 pull.
  * @rmtoll
  *  WUCR   WUPPUPD4       LL_PWR_GetWakeUpPin4Pull
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN_PULL_NO
  *         @arg @ref LL_PWR_WAKEUP_PIN_PULL_UP
  *         @arg @ref LL_PWR_WAKEUP_PIN_PULL_DOWN
  */
__STATIC_INLINE uint32_t LL_PWR_GetWakeUpPin4Pull(void)
{
  uint32_t regValue = STM32_READ_BIT(PWR->WUCR, PWR_WUCR_WUPPUPD4);

  return (uint32_t)(regValue >> PWR_WUCR_WUPPUPD4_Pos);
}

/**
  * @brief  Get the Wake-Up pin 5 pull.
  * @rmtoll
  *  WUCR   WUPPUPD5       LL_PWR_GetWakeUpPin5Pull
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN_PULL_NO
  *         @arg @ref LL_PWR_WAKEUP_PIN_PULL_UP
  *         @arg @ref LL_PWR_WAKEUP_PIN_PULL_DOWN
  */
__STATIC_INLINE uint32_t LL_PWR_GetWakeUpPin5Pull(void)
{
  uint32_t regValue = STM32_READ_BIT(PWR->WUCR, PWR_WUCR_WUPPUPD5);

  return (uint32_t)(regValue >> PWR_WUCR_WUPPUPD5_Pos);
}

#if defined(PWR_WUCR_WUPEN6)
/**
  * @brief  Get the Wake-Up pin 6 pull.
  * @rmtoll
  *  WUCR   WUPPUPD6       LL_PWR_GetWakeUpPin6Pull
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN_PULL_NO
  *         @arg @ref LL_PWR_WAKEUP_PIN_PULL_UP
  *         @arg @ref LL_PWR_WAKEUP_PIN_PULL_DOWN
  */
__STATIC_INLINE uint32_t LL_PWR_GetWakeUpPin6Pull(void)
{
  uint32_t regValue = STM32_READ_BIT(PWR->WUCR, PWR_WUCR_WUPPUPD6);

  return (uint32_t)(regValue >> PWR_WUCR_WUPPUPD6_Pos);
}
#endif /* PWR_WUCR_WUPEN6 */

#if defined(PWR_WUCR_WUPEN7)
/**
  * @brief  Get the Wake-Up pin 7 pull.
  * @rmtoll
  *  WUCR   WUPPUPD7       LL_PWR_GetWakeUpPin7Pull
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN_PULL_NO
  *         @arg @ref LL_PWR_WAKEUP_PIN_PULL_UP
  *         @arg @ref LL_PWR_WAKEUP_PIN_PULL_DOWN
  */
__STATIC_INLINE uint32_t LL_PWR_GetWakeUpPin7Pull(void)
{
  uint32_t regValue = STM32_READ_BIT(PWR->WUCR, PWR_WUCR_WUPPUPD7);

  return (uint32_t)(regValue >> PWR_WUCR_WUPPUPD7_Pos);
}
#endif /* PWR_WUCR_WUPEN7 */

/**
  * @brief  Get the Wake-Up pin pull.
  * @rmtoll
  *  WUCR   WUPPUPDx       LL_PWR_GetWakeUpPinPull
  * @param  wakeup_pin This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN_1
  *         @arg @ref LL_PWR_WAKEUP_PIN_2
#if PWR_WUCR_WUPEN3
  *         @arg @ref LL_PWR_WAKEUP_PIN_3
#endif
  *         @arg @ref LL_PWR_WAKEUP_PIN_4
  *         @arg @ref LL_PWR_WAKEUP_PIN_5
#if PWR_WUCR_WUPEN6
  *         @arg @ref LL_PWR_WAKEUP_PIN_6
#endif
#if PWR_WUCR_WUPEN7
  *         @arg @ref LL_PWR_WAKEUP_PIN_7
#endif
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN_PULL_NO
  *         @arg @ref LL_PWR_WAKEUP_PIN_PULL_UP
  *         @arg @ref LL_PWR_WAKEUP_PIN_PULL_DOWN
  */
__STATIC_INLINE uint32_t LL_PWR_GetWakeUpPinPull(uint32_t wakeup_pin)
{
  uint32_t regValue = STM32_READ_BIT(PWR->WUCR, (PWR_WUCR_WUPPUPD1 << ((LL_PWR_WAKEUP_PINS_PULL_SHIFT_OFFSET * \
                                                                        (STM32_POSITION_VAL(wakeup_pin) & 0xFU)) & \
                                                                       LL_PWR_WAKEUP_PINS_MAX_SHIFT_MASK)));

  return (uint32_t)(regValue >> ((PWR_WUCR_WUPPUPD1_Pos + ((LL_PWR_WAKEUP_PINS_PULL_SHIFT_OFFSET * \
                                                            STM32_POSITION_VAL(wakeup_pin)) & 0xFU)) & \
                                 LL_PWR_WAKEUP_PINS_MAX_SHIFT_MASK));
}

/**
  * @brief  Enable IO retention.
  * @rmtoll
  *  IORETR        IORETEN           LL_PWR_EnableIORetentionStandbyMode
  */
__STATIC_INLINE void LL_PWR_EnableIORetentionStandbyMode(void)
{
  STM32_SET_BIT(PWR->IORETR, PWR_IORETR_IORETEN);
}

/**
  * @brief  Disable IO retention.
  * @rmtoll
  *  IORETR        IORETEN           LL_PWR_DisableIORetentionStandbyMode
  */
__STATIC_INLINE void LL_PWR_DisableIORetentionStandbyMode(void)
{
  STM32_CLEAR_BIT(PWR->IORETR, PWR_IORETR_IORETEN);
}

/**
  * @brief  Check whether I/O retention is enabled.
  * @rmtoll
  *  IORETR        IORETEN           LL_PWR_IsEnabledIORetentionStandbyMode
  * @return State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledIORetentionStandbyMode(void)
{
  return ((STM32_READ_BIT(PWR->IORETR, PWR_IORETR_IORETEN) == (PWR_IORETR_IORETEN)) ? 1UL : 0UL);
}

/**
  * @brief  Enable JTAGIO retention.
  * @rmtoll
  *  IORETR    JTAGIORETEN       LL_PWR_EnableJTAGIORetentionStandbyMode
  */
__STATIC_INLINE void LL_PWR_EnableJTAGIORetentionStandbyMode(void)
{
  STM32_SET_BIT(PWR->IORETR, PWR_IORETR_JTAGIORETEN);
}

/**
  * @brief  Disable JTAGIO retention.
  * @rmtoll
  *  IORETR     JTAGIORETEN      LL_PWR_DisableJTAGIORetentionStandbyMode
  */
__STATIC_INLINE void LL_PWR_DisableJTAGIORetentionStandbyMode(void)
{
  STM32_CLEAR_BIT(PWR->IORETR, PWR_IORETR_JTAGIORETEN);
}

/**
  * @brief  Check whether JTAGIO retention is enabled.
  * @rmtoll
  *  IORETR     JTAGIORETEN          LL_PWR_IsEnabledJTAGIORetentionStandbyMode
  * @return State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsEnabledJTAGIORetentionStandbyMode(void)
{
  return ((STM32_READ_BIT(PWR->IORETR, PWR_IORETR_JTAGIORETEN) == (PWR_IORETR_JTAGIORETEN)) ? 1UL : 0UL);
}
/**
  * @}
  */

/** @defgroup PWR_LL_EF_FLAG_MANAGEMENT PWR FLAG Management
  * @{
  */

/**
  * @brief  Indicate whether the system was in standby mode or not.
  * @rmtoll
  *  PMSR          SBF          LL_PWR_IsActiveFlag_SB
  * @return State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_SB(void)
{
  return ((STM32_READ_BIT(PWR->PMSR, PWR_PMSR_SBF) == (PWR_PMSR_SBF)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate whether the system was in stop mode or not.
  * @rmtoll
  *  PMSR          STOPF          LL_PWR_IsActiveFlag_STOP
  * @return State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_STOP(void)
{
  return ((STM32_READ_BIT(PWR->PMSR, PWR_PMSR_STOPF) == (PWR_PMSR_STOPF)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate whether the VDD voltage is below the threshold or not.
  * @rmtoll
  *  VMSR          PVDO          LL_PWR_IsActiveFlag_PVDO
  * @return State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_PVDO(void)
{
  return ((STM32_READ_BIT(PWR->VMSR, PWR_VMSR_PVDO) == (PWR_VMSR_PVDO)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate whether a wakeup event is detected on wake up pin 1.
  * @rmtoll
  *  WUSR          WUF1          LL_PWR_IsActiveFlag_WU1
  * @return State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WU1(void)
{
  return ((STM32_READ_BIT(PWR->WUSR, PWR_WUSR_WUF1) == (PWR_WUSR_WUF1)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate whether a wakeup event is detected on wake up pin 2.
  * @rmtoll
  *  WUSR          WUF2          LL_PWR_IsActiveFlag_WU2
  * @return State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WU2(void)
{
  return ((STM32_READ_BIT(PWR->WUSR, PWR_WUSR_WUF2) == (PWR_WUSR_WUF2)) ? 1UL : 0UL);
}

#if defined (PWR_WUSR_WUF3)
/**
  * @brief  Indicate whether a wakeup event is detected on wake up pin 3.
  * @rmtoll
  *  WUSR          WUF3          LL_PWR_IsActiveFlag_WU3
  * @return State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WU3(void)
{
  return ((STM32_READ_BIT(PWR->WUSR, PWR_WUSR_WUF3) == (PWR_WUSR_WUF3)) ? 1UL : 0UL);
}
#endif /* PWR_WUSR_WUF3 */

/**
  * @brief  Indicate whether a wakeup event is detected on wake up pin 4.
  * @rmtoll
  *  WUSR          WUF4          LL_PWR_IsActiveFlag_WU4
  * @return State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WU4(void)
{
  return ((STM32_READ_BIT(PWR->WUSR, PWR_WUSR_WUF4) == (PWR_WUSR_WUF4)) ? 1UL : 0UL);
}

/**
  * @brief  Indicate whether a wakeup event is detected on wake up pin 5.
  * @rmtoll
  *  WUSR          WUF5          LL_PWR_IsActiveFlag_WU5
  * @return State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WU5(void)
{
  return ((STM32_READ_BIT(PWR->WUSR, PWR_WUSR_WUF5) == (PWR_WUSR_WUF5)) ? 1UL : 0UL);
}

#if defined (PWR_WUSR_WUF6)
/**
  * @brief  Indicate whether a wakeup event is detected on wake up pin 6.
  * @rmtoll
  *  WUSR          WUF6          LL_PWR_IsActiveFlag_WU6
  * @return State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WU6(void)
{
  return ((STM32_READ_BIT(PWR->WUSR, PWR_WUSR_WUF6) == (PWR_WUSR_WUF6)) ? 1UL : 0UL);
}
#endif /* PWR_WUSR_WUF6 */

#if defined (PWR_WUSR_WUF7)
/**
  * @brief  Indicate whether a wakeup event is detected on wake up pin 7.
  * @rmtoll
  *  WUSR          WUF7          LL_PWR_IsActiveFlag_WU7
  * @return State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WU7(void)
{
  return ((STM32_READ_BIT(PWR->WUSR, PWR_WUSR_WUF7) == (PWR_WUSR_WUF7)) ? 1UL : 0UL);
}
#endif /* PWR_WUSR_WUF7 */

/**
  * @brief  Indicate whether a wakeup event has been detected on the selected wake up pin.
  * @rmtoll
  *  WUSR          WUF1          LL_PWR_IsActiveFlag_WU \n
  *  WUSR          WUF2          LL_PWR_IsActiveFlag_WU \n
#if PWR_WUSR_WUF3
  *  WUSR          WUF3          LL_PWR_IsActiveFlag_WU \n
#endif
  *  WUSR          WUF4          LL_PWR_IsActiveFlag_WU \n
  *  WUSR          WUF5          LL_PWR_IsActiveFlag_WU \n
#if PWR_WUSR_WUF6
  *  WUSR          WUF6          LL_PWR_IsActiveFlag_WU
#endif
#if PWR_WUSR_WUF7
  *  WUSR          WUF7          LL_PWR_IsActiveFlag_WU
#endif
  * @param  wakeup_pin
  *         This parameter can be one of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN_1
  *         @arg @ref LL_PWR_WAKEUP_PIN_2
#if PWR_WUCR_WUPEN3
  *         @arg @ref LL_PWR_WAKEUP_PIN_3
#endif
  *         @arg @ref LL_PWR_WAKEUP_PIN_4
  *         @arg @ref LL_PWR_WAKEUP_PIN_5
#if PWR_WUCR_WUPEN6
  *         @arg @ref LL_PWR_WAKEUP_PIN_6
#endif
#if PWR_WUCR_WUPEN7
  *         @arg @ref LL_PWR_WAKEUP_PIN_7
#endif
  * @return State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_PWR_IsActiveFlag_WU(uint32_t wakeup_pin)
{
  return ((STM32_READ_BIT(PWR->WUSR, wakeup_pin) == (wakeup_pin)) ? 1UL : 0UL);
}

/**
  * @brief  Clear Stop flag.
  * @rmtoll
  *  PMCR          CSSF          LL_PWR_ClearFlag_STOP
  * @warning STOPF and SBF flags are cleared together using this API.
  */
__STATIC_INLINE void LL_PWR_ClearFlag_STOP(void)
{
  STM32_SET_BIT(PWR->PMCR, PWR_PMCR_CSSF);
}

/**
  * @brief  Clear Standby flag.
  * @rmtoll
  *  PMCR          CSSF          LL_PWR_ClearFlag_SB
  * @warning STOPF and SBF flags are cleared together using this API.
  */
__STATIC_INLINE void LL_PWR_ClearFlag_SB(void)
{
  STM32_SET_BIT(PWR->PMCR, PWR_PMCR_CSSF);
}

/**
  * @brief  Clear wake up flag 1.
  * @rmtoll
  *  WUSCR          CWUF1         LL_PWR_ClearFlag_WU1
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WU1(void)
{
  STM32_WRITE_REG(PWR->WUSCR, PWR_WUSCR_CWUF1);
}

/**
  * @brief  Clear wake up flag 2.
  * @rmtoll
  *  WUSCR          CWUF2         LL_PWR_ClearFlag_WU2
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WU2(void)
{
  STM32_WRITE_REG(PWR->WUSCR, PWR_WUSCR_CWUF2);
}

#if defined(PWR_WUCR_WUPEN3)
/**
  * @brief  Clear wake up flag 3.
  * @rmtoll
  *  WUSCR          CWUF3         LL_PWR_ClearFlag_WU3
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WU3(void)
{
  STM32_WRITE_REG(PWR->WUSCR, PWR_WUSCR_CWUF3);
}
#endif /* PWR_WUCR_WUPEN3 */

/**
  * @brief  Clear wake up flag 4.
  * @rmtoll
  *  WUSCR          CWUF4         LL_PWR_ClearFlag_WU4
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WU4(void)
{
  STM32_WRITE_REG(PWR->WUSCR, PWR_WUSCR_CWUF4);
}

/**
  * @brief  Clear wake up flag 5.
  * @rmtoll
  *  WUSCR          CWUF5         LL_PWR_ClearFlag_WU5
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WU5(void)
{
  STM32_WRITE_REG(PWR->WUSCR, PWR_WUSCR_CWUF5);
}

