MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/ll/stm32c5xx_ll_pwr.h
#if defined (PWR_WUSCR_CWUF6)
/**
  * @brief  Clear wake up flag 6.
  * @rmtoll
  *  WUSCR          CWUF6         LL_PWR_ClearFlag_WU6
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WU6(void)
{
  STM32_WRITE_REG(PWR->WUSCR, PWR_WUSCR_CWUF6);
}
#endif /* PWR_WUSCR_CWUF6 */

#if defined (PWR_WUSCR_CWUF7)
/**
  * @brief  Clear wake up flag 7.
  * @rmtoll
  *  WUSCR          CWUF7         LL_PWR_ClearFlag_WU7
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WU7(void)
{
  STM32_WRITE_REG(PWR->WUSCR, PWR_WUSCR_CWUF7);
}
#endif /* PWR_WUSCR_CWUF7 */

/**
  * @brief  Clear wakeup pin flags.
  * @rmtoll
  *  WUSCR           WKUPC1           LL_PWR_ClearFlag_WU \n
  *  WUSCR           WKUPC2           LL_PWR_ClearFlag_WU \n
#if PWR_WUCR_WUPEN3
  *  WUSCR           WKUPC3           LL_PWR_ClearFlag_WU \n
#endif
  *  WUSCR           WKUPC4           LL_PWR_ClearFlag_WU \n
  *  WUSCR           WKUPC5           LL_PWR_ClearFlag_WU \n
#if PWR_WUCR_WUPEN6
  *  WUSCR           WKUPC6           LL_PWR_ClearFlag_WU \n
#endif
#if PWR_WUCR_WUPEN7
  *  WUSCR           WKUPC7           LL_PWR_ClearFlag_WU
#endif
  * @param  wakeup_pin
  *         This parameter can be one or a combination of the following values:
  *         @arg @ref LL_PWR_WAKEUP_PIN_1
  *         @arg @ref LL_PWR_WAKEUP_PIN_2
#if PWR_WUCR_WUPEN3
  *         @arg @ref LL_PWR_WAKEUP_PIN_3
#endif
  *         @arg @ref LL_PWR_WAKEUP_PIN_4
  *         @arg @ref LL_PWR_WAKEUP_PIN_5
#if PWR_WUCR_WUPEN6
  *         @arg @ref LL_PWR_WAKEUP_PIN_6
#endif
#if PWR_WUCR_WUPEN7
  *         @arg @ref LL_PWR_WAKEUP_PIN_7
#endif
  *         @arg @ref LL_PWR_WAKEUP_PIN_ALL
  */
__STATIC_INLINE void LL_PWR_ClearFlag_WU(uint32_t wakeup_pin)
{
  STM32_WRITE_REG(PWR->WUSCR, wakeup_pin);
}
/**
  * @}
  */

/** @defgroup PWR_LL_EF_ATTRIBUTE_MANAGEMENT PWR Attribute Management
  * @{
  */
/**
  * @brief  Set the privilege attribute.
  * @rmtoll
  *  PRIVCFGR     PRIV        LL_PWR_SetPrivAttr
  * @param  item The item attribute to be configured.
  * @param  priv_attr This parameter can be one of the following values:
  *         @arg @ref LL_PWR_ATTR_NPRIV
  *         @arg @ref LL_PWR_ATTR_PRIV
  * @note  This register can be written only when the access is privileged.
  */
__STATIC_INLINE void LL_PWR_SetPrivAttr(uint32_t item, uint32_t priv_attr)
{
  STM32_MODIFY_REG(PWR->PRIVCFGR, item, (item * priv_attr));
}

/**
  * @brief  Get the privilege attribute.
  * @rmtoll
  *  PRIVCFGR     PRIV        LL_PWR_GetPrivAttr
  *
  * @param  item The item attribute to be queried.
  * @return Returned value can be one of the following values:
  *         @arg @ref LL_PWR_ATTR_NPRIV
  *         @arg @ref LL_PWR_ATTR_PRIV
  */
__STATIC_INLINE uint32_t LL_PWR_GetPrivAttr(uint32_t item)
{
  return ((STM32_READ_BIT(PWR->PRIVCFGR, item) == item) ? 1UL : 0UL);
}
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#endif /* defined (PWR) */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* STM32C5XX_LL_PWR_H */
